In [1]:
import pandas as pd

In [5]:
df=pd.read_csv(r"C:\Users\Magic\Downloads\Bank_Customer.csv")

In [6]:
df.shape

(1090, 6)

In [7]:
df.head()

    age           job  marital  education  balance duration
0  58.0    management  married   tertiary     2143      261
1  44.0    technician   single  secondary       29      151
2  33.0  entrepreneur  married  secondary        2       76
3  47.0   blue-collar  married    unknown     1506       92
4  33.0       unknown   single    unknown        1      198

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1090 entries, 0 to 1089
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        1000 non-null   float64
 1   job        1090 non-null   object
 2   marital    1090 non-null   object
 3   education  1090 non-null   object
 4   balance    1090 non-null   int64
 5   duration   1090 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 51.2+ KB

In [48]:
df["duration"]=pd.to_numeric(df["duration"],errors='coerce')

In [51]:
df["duration"].dtypes

dtype('float64')

In [49]:
df.describe()

               age       balance     duration
count  1090.000000   1090.000000  1081.000000
mean     42.582000    564.387156   271.749306
std       8.687159   2553.749723   252.007604
min      22.000000   -932.000000     2.000000
25%      36.000000     22.000000   130.000000
50%      42.582000    173.000000   204.000000
75%      49.000000    443.500000   320.000000
max      61.000000  58544.000000  2177.000000

In [30]:
df[df["marital"]=="single"]

         age          job marital  education  balance duration
1     44.000   technician  single  secondary       29      151
4     33.000      unknown  single    unknown        1      198
6     28.000   management  single   tertiary      447      217
9     43.000   technician  single  secondary      593       55
11    29.000       admin.  single  secondary      390      137
...      ...          ...     ...        ...      ...      ...
1073  42.582  blue-collar  single  secondary       29      214
1075  42.582     services  single    primary      114       99
1077  42.582  blue-collar  single  secondary        0      191
1081  42.582   technician  single  secondary       99      283
1086  42.582  blue-collar  single    unknown     2167     1273

[241 rows x 6 columns]

In [34]:
df[df["job"]=="retired"].balance.sum()

25130

In [11]:
df["job"].value_counts()

blue-collar      333
technician       163
admin.           149
management       146
services         141
retired           47
entrepreneur      32
self-employed     27
unemployed        23
student           14
housemaid         10
unknown            5
Name: job, dtype: int64

In [12]:
df["marital"].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [13]:
df["marital"].value_counts()

married     693
single      241
divorced    156
Name: marital, dtype: int64

In [15]:
df.isna().sum()

age          90
job           0
marital       0
education     0
balance       0
duration      0
dtype: int64

In [26]:
df.fillna(df["age"].mean(), inplace=True)

In [27]:
df.isna().sum()

age          0
job          0
marital      0
education    0
balance      0
duration     0
dtype: int64

In [78]:
df.duplicated().sum()

0

In [59]:
df["education"].unique()

'tertiarysecondaryunknownprimary'

In [36]:
df["job"].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [43]:
df[df["balance"]<0]

         age          job   marital  education  balance duration
25    44.000       admin.   married  secondary     -372      172
28    46.000   management    single  secondary     -246      255
36    25.000  blue-collar   married  secondary       -7      365
37    53.000   technician   married  secondary       -3     1666
45    36.000       admin.    single    primary     -171      242
...      ...          ...       ...        ...      ...      ...
1054  42.582  blue-collar   married    primary      -20      353
1056  42.582  blue-collar   married    primary     -171      441
1062  42.582   technician  divorced   tertiary     -317      381
1064  42.582     services    single  secondary     -158      128
1078  42.582   management   married    primary      -24      305

[99 rows x 6 columns]

In [44]:
df[df["balance"]<0].job

25           admin.
28       management
36      blue-collar
37       technician
45           admin.
           ...
1054    blue-collar
1056    blue-collar
1062     technician
1064       services
1078     management
Name: job, Length: 99, dtype: object

In [72]:
int(df[df["balance"]>1000].age.mean())

45

In [77]:
df.nlargest(10,"balance")["job"]

920         admin.
446     technician
334     management
69     blue-collar
34      management
916       services
391     technician
382     management
908        retired
757      housemaid
Name: job, dtype: object

In [74]:
filt=df["job"]=="housemaid"
df.loc[filt]["balance"]

140      947
212      195
218      965
400       17
471      109
531      203
755        0
757     6920
882       98
1076     365
Name: balance, dtype: int64

In [86]:
df[df["duration"]>100].balance.mean()

592.1286486486487